Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-10-18.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་སློང་བལྟ་ན་སྡུག་པ་དེའི་གདམས་ངག་རྗེས་སུ་སློས་ཤིང་སྤེལ་བ་དང་། བསྡུད་པ་དང་རབ་ཏུ་དབྱེ་བ་དང་། བཤད་པ་དང་། སོ་སོར་རྣམ་པར་བསྒོམ་པ་དང་བརྗོད་པ་དང་། ཡང་དག་པར་བསྟན་པ་དང་། རྗེས་སུ་བསམ་པ་དང་། མངོན་པར་འཇུག་པར་བྱ་བ་དང་། བཀུར་བ་དང་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། ཡང་དག་པར་གཞོལ་བར་བྱ་བ་དང་། ཡང་དང་ཡང་བསླས་པ་དང་། ཤིན་ཏུ་རྟོགས་པར་བྱ་བ་དང་། རབ་ཏུ་བསྟན་པ་དང་། སྣང་བར་བྱ་བ་དང་། རྗེས་སུ་རྣམ་པར་ལྟ་བ་དང་། ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟའི་འཁོར་དང་བཅས་པ་དེ་མཐར་གྱིས་ཡུལ་དགེ་སྦྱོང་གི་དཀྱིལ་འཁོར་གྱི་གྲོང་ཁྱེར་སྒོ་བཟང་པོ་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Sudhana, the head merchant’s son, recited, promulgated, presented, investigated, elucidated, reflected on, described, taught, contemplated, bestowed, understood, was immersed in, repeated again and again, realized, propounded, illuminated, and surveyed the teaching of the bhikṣu Sudarśana. He eventually, with an entourage of devas, nāgas, yakṣas, and gandharvas, arrived at the city of Sumukha in the land called Śramaṇa­maṇḍala.

source: ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་ཡོངས་སུ་ཚོལ་ཚོལ་བ་ལས་དེའི་སྟེང་གི་བར་སྣང་ལས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་རྣམས་ཀྱིས་བོས་པ། རིགས་ཀྱི་བུ་ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་ནི། ཆུ་ཀླུང་གི་ཆུ་འདུས་པ་ཉེ་བ་ཞིག་ན། བྱིས་པ་སྟོང་ཕྲག་བཅུ་ཙམ་གྱིས་བསྐོར་ཏེ།
en: He searched for the boy Indriyeśvara until the devas, nāgas, yakṣas, and gandharvas in the sky above called down, “Noble one, the boy Indriyeśvara, accompanied by ten thousand other children, is playing in the sand at the conflux of the rivers.”

source: བྱེ་མ་ལ་རྩེ་བས་རྩེ་ཞིང་འདུག་གོ་ཞེས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་སྒོ་བཟང་པོ་དང་། ཉེ་བའི་ཆུ་ཀླུང་གི་ཆུ་འདུས་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། དེས་ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་བྱིས་པ་སྟོང་ཕྲག་བཅུ་ཙམ་གྱིས་བསྐོར་ཅིང་བྱེ་མ་ལ་རྩེ་བས་རྩེ་བ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་གང་ན་བ་དེར་སོང་སྟེ།
en: Then Sudhana, the head merchant’s son, went into the city of Sumukha toward the confluence of the rivers. When he arrived there, he saw the boy Indriyeśvara accompanied by ten thousand children, playing in the sand.

source: ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་གི་མདུན་དུ་འདུག་སྟེ།
en: When he saw the boy Indriyeśvara, he approached him, bowed his head to the boy Indriyeśvara’s feet, circumambulated the boy Indriyeśvara many hundreds of thousands of times, keeping him to his right, and then sat down before the boy Indriyeśvara.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: He placed the palms of his hands together and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏ།
en: How does a bodhisattva train in bodhisattva conduct? In what way does a bodhisattva practice it?”

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: “Ārya, I have heard that you teach and give instructions to bodhisattvas.

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཡི་གེ་དང་། གྲངས་དང་། བརྡ་དང་། །རྩིས་ཀྱི་ཚུལ་བསླབས་ཏེ།
en: Indriyeśvara said, “Noble one, Mañjuśrī Kumāra­bhūta has taught me writing, numbers, symbols, and counting so that I entered through the gateway called the wisdom that possesses clairvoyance in all crafts . “Thus, noble one, I know all writing and terminology in this world;

source: བཟོ་ཐམས་ཅད་མངོན་པར་ཤེས་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཡེ་ཤེས་ཀྱི་སྒོར་བཅུག་གོ །དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་འཇིག་རྟེན་ན་ཡི་གེ་དང་། མྱིང་གི་རྣམ་པ་དང་། གྲངས་དང་། རྩིས་དང་། བརྡ་དང་། ཤོད་ཐབས་ཤེས་པར་བྱ་བ་དང་། བཟོ་སྣ་ཚོགས་ཤེས་པར་བྱ་བ་དང་། ཁམས་ཀྱི་ཆོ་ག་དང་། དུག་གསོ་བའི་ཐབས་དང་། སྐེམ་པ་དང་། བརྗེད་བྱེད་དང་། འབྱུང་པོའི་གདོན་གྱིས་བཏབ་པ་གསོ་བ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། ཚོང་དུས་དང་། བཟའ་ཤིང་གི་ར་བ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། གནས་རྣམ་པར་དགོད་པ་ཤེས་པར་བྱ་བ་དང་། ར་བ་དང་། ཁང་པ་དང་། སྐར་ཁུང་དང་། ཁང་པ་བརྩེགས་པའི་ཚད་ཤེས་པར་བྱ་བ་དང་། འཁྲུལ་འཁོར་དང་། ཤིང་རྟ་སྦྱར་བའི་ཚུལ་སྣ་ཚོགས་ཤེས་པར་བྱ་བ་དང་། དགེ་མི་དགེ་དང་། འཇིགས་མི་འཇིགས་ཀྱི་ལྟས་དང་། མཚན་མ་ཤེས་པར་བྱ་བ་དང་། རྨོས་དང་། ཚོང་དང་། རྣམ་པར་སྤྱད་པ་སྦྱར་བའི་ཆོ་ག་ཤེས་པར་བྱ་བ་དང་། སེམས་ཅན་གྱི་ཡན་ལག་དང་། ཉིང་ལག་གི་མཚན་གྱི་རྒྱུད་དང་། རྒྱུས་དང་། རྣམ་པར་དཔྱད་པ་ཤེས་པར་བྱ་བ་དང་། བདེ་འགྲོ་དང་ངན་སོང་གི་ལས་ཀྱི་ལམ་རྣམ་པར་དག་པར་བྱ་བའི་ཚུལ་ཤེས་པར་བྱ་བ་དང་། དགེ་བ་དང་མི་དགེ་བའི་ཆོས་དང་། ཚོགས་མཆོད་པ་ཤེས་པར་བྱ་བ་དང་། བདེ་འགྲོ་དང་ངན་སོང་གི་ཚོགས་ཤེས་པར་བྱ་བ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་ཚོགས་ཤེས་པར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སའི་ཚོགས་ཤེས་པར་བྱ་བ་དང་། རྒྱུ་དང་བྱེད་པ་དང་། སྦྱོར་བའི་རྒྱུད་ཤེས་པར་བྱ་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཤེས་ཏེ།
en: all numbers, calculations, symbols, the knowledge of dice throwing, and the knowledge of the various crafts; physiology; methods to cure poisoning; exorcising śoṣas, apasmāras, bhūtas, pretas, and demons ; the knowledge of where to establish villages, towns, marketplaces, cities, parks, and forest groves for ascetics;

source: དེ་དག་ལ་སེམས་ཅན་ཡོངས་སུ་གཟུད་པ་བྱེད་དོ།
en: the knowledge of the measurements of walls, houses, windows, and kūṭāgāras;

source: །རབ་ཏུ་དགོད་པ་བྱེད་དོ། །ཡོངས་སུ་གཞོག་པ་བྱེད་དོ།
en: the knowledge of how to make various machines and chariots;

source: །སློབ་ཏུ་འཛུད་དོ།
en: the knowledge of good and bad omens, omens of danger and safety;

source: །སྦྱོང་དུ་འཛུད་དོ། །བརྟན་པར་བྱེད་དོ། །ལྷུར་ལེན་པར་བྱེད་དོ། །རྫོགས་པར་བྱེད་དོ། །ཡོངས་སུ་སྒྲུབ་པར་བྱེད་དོ། །ཡོངས་སུ་སྤྱོད་པར་བྱེད་དོ། །གསལ་བར་བསྟན་པར་བྱེད་དོ། །རྣམ་པར་འཕེལ་བར་བྱེད་དོ།
en: the knowledge of the practices of farming and business; the knowledge of the analysis of the signs of the movement and characteristics of the limbs and the minor extensions of the body;

source: །མཚན་མར་བྱེད་དོ།
en: the knowledge of the ways of purifying the path of karma that leads to the higher realms or the lower existences; the knowledge of good and bad groups and offerings;

source: །མཐར་ཕྱིན་པར་བྱེད་དོ།
en: the knowledge of the accumulations that lead to the higher existences or to the lower existences; the knowledge of the accumulations that lead to the Śrāvakayāna and Pratyeka­buddhayāna; the knowledge of the accumulations that lead to the level of the tathāgatas;

source: །རྣམ་པར་སྦྱོང་བར་བྱེད་དོ། །དྲི་མ་མེད་པར་བྱེད་དོ། །ཤིན་ཏུ་དག་པར་བྱེད་དོ།
en: and the knowledge of the processes of application to causes and actions.

source: །འོད་གསལ་ཞིང་དང་བར་བྱེད་དོ། །ཤིན་ཏུ་ཡངས་པར་བྱེད་དོ།
en: “I make all beings enter into those knowledges, settle them in those knowledges, establish them in those knowledges, make them study those knowledges, make them practice those knowledges, make them stable in those knowledges, make them dedicated to those knowledges, make them complete those knowledges, make them accomplished in those knowledges, make them use those knowledges, make them elevate those knowledges, make them increase those knowledges, make those knowledges effective, bring those knowledges to their conclusion, make them purify those knowledges, make those knowledges stainless, make those knowledges shine, make those knowledges bright and clear, and make those knowledges vast.

source: །དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྩིས་ཀྱི་ཚུལ་ཤེས་པ་དེ་གང་ཞེ་ན། །བརྒྱ་སྟོང་ཕྲག་བརྒྱ་ན་བྱེ་བའོ། །བྱེ་བ་བྱེ་བ་ན་ཁོད་ཁོད་དོ། །ཁོད་ཁོད་ཁོད་ཁོད་ན་ཐ་དགུའོ། །ཐ་དགུ་ཐ་དགུ་ན་ཁྲིག་ཁྲིག་གོ །ཁྲིག་ཁྲིག་ཁྲིག་ཁྲིག་ན་ཐམས་ཐམས་སོ། །ཐམས་ཐམས་ཐམས་ཐམས་ན་མྱང་མྱིད་དོ།
en: “Thus, noble one, I know the way of calculations of the bodhisattvas.

source: །མྱད་མྱིད་མྱད་མྱིད་ན་གང་ཡའོ། །གང་ཡ་གང་ཡ་ན་བན་བུན་ནོ། །བན་བུན་བན་བུན་ན་ཕྱར་ཕྱུར་རོ། །ཕྱར་ཕྱུར་ཕྱར་ཕྱུར་ན་ལྕག་ལྕིག་གོ །ལྕག་ལྕིག་ལྕག་ལྕིག་ན་བྱང་བྱིང་ངོ་། །བྱང་བྱིང་བྱང་བྱིང་ན་ཆེམ་ཆེམ་མོ། །ཆེམ་ཆེམ་ཆེམ་ཆེམ་ན་ཕྱལ་ཕྱོལ་ལོ། །ཕྱལ་ཕྱོལ་ཕྱལ་ཕྱོལ་ན་ཁྱུད་ཁྱུད་དོ། །ཁྱུད་ཁྱུད་ཁྱུད་ཁྱུད་ན་ཟར་ཟེར་རོ། །ཟར་ཟེར་ཟར་ཟེར་ན་ཁྲིབ་ཁྲིབ་བོ། །ཁྲིབ་ཁྲིབ་ཁྲིབ་ཁྲིབ་ན་ཡ་གངས་སོ། །ཡ་གངས་ཡ་གངས་ན་ཆོ་མའོ། །ཆོ་མ་ཆོ་མ་ན་ཁྲམ་ཁྲིམ་མོ། །ཁྲམ་ཁྲིམ་ཁྲམ་ཁྲིམ་ན་ནབ་ནུབ་བོ། །ནབ་ནུབ་ནབ་ནུབ་ན་སང་སང་ངོ་། །སང་སང་སང་སང་ན་བརྒྱུད་ཡས་སོ། །བརྒྱུད་ཡས་བརྒྱུད་ཡས་ན་བཏང་ཡས་སོ། །བཏང་ཡས་བཏང་ཡས་ན་བཀྲ་ཡར་རོ། །བཀྲ་ཡར་བཀྲ་ཡར་ན་གསའ་ཡས་སོ། །གསའ་ཡས་གསའ་ཡས་ན་མཚུངས་མེད་དོ། །མཚུངས་མེད་མཚུངས་མེད་ན་ལམ་ལུམ་མོ། །ལམ་ལུམ་ལམ་ལུམ་ན་ཡལ་ཡོལ་ལོ། །ཡལ་ཡོལ་ཡལ་ཡོལ་ན་ཁྲལ་ཁྲུལ་ལོ། །ཁྲལ་ཁྲུལ་ཁྲལ་ཁྲུལ་ན་ཐུད་ཐུད་དོ། །ཐུང་ཐུང་ཐུང་ཐུང་ན་བསམ་ཕྱོད་དོ། །བསམ་ཕྱོད་བསམ་ཕྱོད་ན་བྲང་བྲེང་ངོ་། །བྲང་བྲེང་བྲང་བྲེད་ན་བགྲོད་ཡས་སོ། །བགྲོད་ཡས་བགྲོད་ཡས་ན་བསྔོ་ཡས་སོ། །བསྔོ་ཡས་བསྔོ་ཡས་ན་ཟང་ཡག་གོ །ཟང་ཡག་ཟང་ཡག་ན་འཕྲོ་བ་ཀྱེའོ། །འཕྲོ་བཀྱེ་འཕྲོ་བཀྱེ་ན་རྩེ་འཕྱོའོ། །རྩེ་འཕྱོ་རྩེ་འཕྱོ་ན་ཡོང་ཏན་ནོ། །ཡོང་ཏན་ཡོང་ཏན་ན་བྲུག་གཡོས་སོ། །བྲུག་གཡོས་བྲུག་གཡོས་ན་སང་ཡལ་ལོ། །སང་ཡལ་སང་ཡལ་ན་འཐིང་ཡུག་གོ །འཐིང་ཡུག་འཐིང་ཡུག་ན་ཡིད་འཕྱོའོ། །ཡིད་འཕྱོ་ཡིད་འཕྱོ་ན་ནབ་ནེབ་བོ། །ནབ་ནེབ་ནབ་ནེབ་ན་ཁྲིག་ཐམས་སོ། །ཁྲིག་ཐམས་ཁྲིག་ཐམས་ན་ཡལ་ཡལ་ལོ། །ཡལ་ཡལ་ཡལ་ཡལ་ན་བགྲད་ཡས་སོ། །བགྲང་ཡས་བགྲང་ཡས་ན་ཐུག་ཡལ་ལོ། །ཐུག་ཡལ་ཐུག་ཡལ་ན་ཤང་ཤང་ངོ་། །ཤང་ཤང་ཤང་ཤང་ན་ཡག་ཡག་གོ ། ཡག་ཡག་ཡག་ཡག་ན་ཐམ་ཐིམ་མོ། །ཐམ་ཐིམ་ཐམ་ཐིམ་ན་རློམ་བསྙལ་ལོ། །རློམ་བསྙལ་རློམ་བསྙལ་ན་གཞལ་འཕྱོས་སོ། །གཞལ་འཕྱོས་གཞལ་འཕྱོས་ན་གཞལ་ཡལ་ལོ། །གཞལ་ཡལ་གཞལ་ཡལ་ན་གཞལ་མེད་དོ། །གཞལ་མེད་གཞལ་མེད་ན་གཞལ་འཁོར་ཏོ། །གཞལ་འཁོར་གཞལ་འཁོར་ན་གཞལ་ཐིམ་མོ། །གཞལ་ཐིམ་གཞལ་ཐིམ་ན་གར་གཞལ་ལོ། །གར་གཞལ་གར་གཞལ་ན་གཞལ་སངས་སོ། །གཞལ་སངས་གཞལ་སངས་ན་གཞལ་ཐག་གོ །གཞལ་ཐག་གཞལ་ཐག་ན་གཞལ་ཕུལ་ལོ། །གཞལ་ཕུལ་གཞལ་ཕུལ་ན་གཞལ་ཞིའོ། །གཞལ་ཞི་གཞལ་ཞི་ན་འཕྱོ་འགྱུར་རོ། །འཕྱོ་འགྱུར་འཕྱོ་འགྱུར་ན་ཉར་ཉེར་རོ། །ཉར་ཉེར་ཉར་ཉེར་ན་ཕྱག་ཕྱིག་གོ །ཕྱག་ཕྱིག་ཕྱག་ཕྱིག་ན་ཟལ་ཟུལ་ལོ། །ཟལ་ཟུལ་ཟལ་ཟུལ་ན་སལ་སལ་ལོ། །སལ་སལ་སལ་སལ་ན་གཡོ་ལྡེག་གོ །གཡོ་ལྡེག་གཡོ་ལྡེག་ན་ཕན་ཕུན་ནོ། །ཕན་ཕུན་ཕན་ཕུན་ན་བརྣང་ཡའོ། །བརྣང་ཡ་བརྣང་ཡ་ན་རེམ་འདྲོལ་ལོ། །རེམ་འདྲོལ་རེམ་འདྲོལ་ན་རྫི་ངད་དོ། །རྫི་ངད་རྫི་ངད་ན་རྫི་རྡུལ་ལོ། །རྫི་རྡུལ་རྫི་རྡུལ་ན་ཕུན་ཡོལ་ལོ། །ཕུན་ཡོལ་ཕུན་ཡོལ་ན་ངད་ངད་དོ། །ངད་ངད་ངད་ངད་ན་བགྲང་བརྩིའོ། །བགྲང་བརྩི་བགྲང་བརྩི་ན་ཟབ་བགྲང་ངོ་། །ཟབ་བགྲང་ཟབ་བགྲང་ན་དགའ་རྐྱང་ངོ་། །དགའ་རྐྱང་དགའ་རྐྱང་ན་གཞུང་འདལ་ཏོ། །གཞུང་འདལ་གཞུང་འདལ་ན་ཁྲུག་ཕྱད་དོ། །ཁྲུག་ཕྱད་ཁྲུག་ཕྱད་ན་འོལ་ཕྱོད་དོ། །འོལ་ཕྱོད་འོལ་ཕྱོད་ན་གདབ་ཡས་སོ། །གདབ་ཡས་གདབ་ཡས་ན་གཅལ་ཡས་སོ། །གཅལ་ཡས་གཅལ་ཡས་ན་བགྲང་ཡས་སོ། །བགྲང་ཡས་བགྲང་ཡས་ན་བྱིམ་འཕྱོའོ། །བྱིམ་འཕྱོ་བྱིམ་འཕྱོ་ན་ཡམ་མེའོ། །ཡམ་མེ་ཡམ་མེ་ན་བསྙལ་ཡས་སོ། །བསྙལ་ཡས་བསྙལ་ཡས་ན་ལྡབ་ལྡེབ་བོ། །ལྡབ་ལྡེབ་ལྡབ་ལྡེབ་ན་འཕན་ཆད་དོ། །འཕན་ཆད་འཕན་ཆད་ན་ཕང་ཕུང་ངོ་། །ཕང་ཕུང་ཕང་ཕུང་ན་ཁེའུ་ཚང་ངོ་། །ཁེའུ་ཚང་ཁེའུ་ཚང་ན་ཞུང་ཟུང་ངོ་། །ཞུང་ཟུང་ཞུང་ཟུང་ན་མཆོག་ཡལ་ལོ། །མཆོག་ཡལ་མཆོག་ཡལ་ན་མཐའ་རྟུལ་ཏོ། །མཐའ་རྟུལ་མཐའ་རྟུལ་ན་ཡུན་འགྱངས་སོ། །ཡུན་འགྱངས་ཡུན་འགྱངས་ན་བུན་ལོབ་བོ། །བུན་ལོབ་བུན་ལོབ་ན་ལམ་ལོམ་མོ། །ལམ་ལོམ་ལམ་ལོམ་ན་བསྙད་ཡས་སོ། །བསྙད་ཡས་བསྙད་ཡས་ན་ལང་ལིང་ངོ་། །ལང་ལིང་ལང་ལིང་ན་ལྗབ་ལྗིབ་བོ། །ལྗབ་ལྗེབ་ལྗབ་ལྗིབ་ན་མྱི་བརྩལ་ཏོ། །མྱི་བརྩལ་མྱི་བརྩལ་ན་འབྱམ་ཡས་སོ། །འབྱམ་ཡས་འབྱམ་ཡས་ན་ང་འགྲང་ངོ་། ང་འགྲང་ང་འགྲང་ན་སྨོས་ཡལ་ལོ། །སྨོས་ཡལ་སྨོས་ཡལ་ན་བཀྲ་ཆལ་ལོ། །བཀྲ་ཆལ་བཀྲ་ཆལ་ན་ལོ་རྒྱས་སོ། །ལོ་རྒྱས་ལོ་རྒྱས་ན་འབུམ་རྡིབ་བོ།
en: What is it?

source: །འབུམ་རྡིབ་འབུམ་རྡིབ་ན་གང་གུམ་མོ། །གང་གུམ་གང་གུམ་ན་ལ་ལོའོ། །ལ་ལོ་ལ་ལོ་ན་བགྲང་འཕྱོས་སོ། །བགྲང་འཕྱོས་བགྲང་འཕྱོས་ན་བགྲོང་འཕྱོས་ལ་བསྒྲེས་བའོ། །བགྲང་འཕྱོས་ལ་བསྒྲེས་པ་བགྲང་འཕྱོས་ལ་བསྒྲེས་ན་དཔག་ཡས་སོ། །དཔག་ཡས་དཔག་ཡས་ན་དཔག་ཡས་ལ་བསྒྲེས་པའོ། །དཔག་ཡས་ལ་བསྒྲེས་པ་དཔག་ཡས་ལ་བསྒྲེས་ན་ཡལ་ཕྱོད་དོ། །ཡལ་ཕྱོད་ཡལ་ཕྱོད་ན་ཡལ་ཕྱོད་ལ་བསྒྲེས་པའོ། །ཡལ་ཕྱོད་ལ་བསྒྲེས་པ་ཡལ་ཕྱོད་ལ་བསྒྲེས་ན་མུ་ཡལ་ཏོ། །མུ་ཡལ་མུ་ཡལ་ན་མུ་ཡལ་ལ་བསྒྲེས་པའོ། །མུ་ཡལ་ལ་བསྒྲེས་བ་མུ་ཡལ་ལ་བསྒྲེས་པ་ན་བགྲང་ཡོལ་ལོ། །བགྲང་ཡོལ་བགྲང་ཡོལ་ན་བགྲང་ཡོལ་ལ་བསྒྲེས་པའོ། །བགྲང་ཡོལ་ལ་བསྒྲེས་པ་བགྲང་ཡོལ་ལ་བསྒྲེས་ན་མྱི་མཇལ་ཏོ། །མྱི་མཇལ་མྱི་མཇལ་ན་མི་མཇལ་ལ་བསྒྲེས་པའོ། །མི་མཇལ་ལ་བསྒྲེས་བ་མྱི་མཇལ་ལ་བསྒྲེས་ན་བསམ་ཕྱོད་དོ། །བསམ་ཕྱོད་བསམ་ཕྱོད་ན་བསམ་ཕྱོད་ལ་བསྒྲེས་པའོ། །བསམ་ཕྱོད་ལ་བསྒྲེས་པ་བསམ་ཕྱོད་ལ་བསྒྲེས་ན་མཐའ་འབྱམ་མོ། །མཐའ་འབྱམ་མཐའ་འབྱམ་ན་དཔག་ཐག་གོ། །དཔག་ཐག་དཔག་ཐག་ན་དཔག་ཐག་ལ་བསྒྲེས་པའོ། །དཔག་ཐག་ལ་བསྒྲེས་པ་དཔག་ཐག་ལ་བསྒྲེས་ན་བརྗོད་དུ་མྱེད་པའོ། །བརྗོད་དུ་མེད་པ་བརྗོད་དུ་མྱེད་པ་ན་བརྗོད་དུ་མེད་པ་ལ་བསྒྲེས་པའོ། །བརྗོད་དུ་མེད་པ་ལ་བསྒྲེས་པ་བརྗོད་དུ་མེད་པ་ལ་བསྒྲེས་ན་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་ལ་བསྒྲེས་པ་ཤིན་ཏུ་བསྟན་པའོ།
en: “A hundred thousand times a hundred is ten million. Ten million times ten million is an ayuta . An ayuta times an ayuta is a niyuta . A niyuta times a niyuta is a bimbara . A bimbara times a bimbara is a kiṃkara . A kiṃkara times a kiṃkara is an agara . An agara times an agara is a pravara . A pravara times a pravara is a mapara . A mapara times a mapara is an avara . An avara times an avara is a tapara . A tapara times a tapara is a sīma . A sīma times a sīma is a yāma . A yāma times a yāma is a nena . A nena times a nena is an avaga . An avaga times an avaga is one mṛgava . One mṛgava times one mṛgava is one vināha . A vināha times a vināha is one viraga . A viraga times a viraga is one avagama . An avagama times an avagama is a vigava . A vigava times a vigava is a saṃkrama . A saṃkrama times a saṃkrama is a visara . A visara times a visara is a vibhaja . A vibhaja times a vibhaja is a vijaṅgha . A vijaṅgha times a vijaṅgha is a visota . A visota times a visota is a vivāha . A vivāha times a vivāha is a vibhakta . A vibhakta times a vibhakta is a vikhata . A vikhata times a vikhata is a tulana . A tulana times a tulana is an atula . An atula times an atula is a varaṇa . A varaṇa times a varaṇa is a vivaraṇa . A vivaraṇa times a vivaraṇa is an avana . An avana times an avana is a thavana . A thavana times a thavana is a viparya . A viparya times a viparya is a samarya . A samarya times a samarya is a viturṇa . A viturṇa times a viturṇa is an hetura . A hetura times a hetura is a vicāra . A vicāra times a vicāra is a visāra . A visāra times a visāra is a vyatyasta . A vyatyasta times a vyatyasta is an abhyudgata . An abhyudgata times an abhyudgata is a viśiṣṭa . A viśiṣṭa times a viśiṣṭa is a nivala . A nivala times a nivala is a haribha . A haribha times a haribha is a vikṣobha . A vikṣobha times a vikṣobha is a halibha . A halibha times a halibha is a harisa . A harisa times a harisa is an aloka . An aloka times an aloka is a dṛṣṭānta . A dṛṣṭānta times a dṛṣṭānta is a hetuna . A hetuna times a hetuna is a durbuda . A durbuda times a durbuda is a haruṇa . A haruṇa times a haruṇa is an ela . An ela times an ela is a dumela . A dumela times a dumela is a kṣemu . A kṣemu times a kṣemu is an akṣayamukta . An akṣayamukta times an akṣayamukta is an elada . An elada times an elada is a māluda . A māluda times a māluda is a maṇḍumā . A maṇḍumā times a maṇḍumā is a viṣamatā . A viṣamatā times a viṣamatā is a samatā . A samatā times a samatā is a visada . A visada times a visada is a pramantā . A pramantā times a pramantā is a pramātra . A pramātra times a pramātra is an amātra . An amātra times an amātra is a bhramātra . A bhramātra times a bhramātra is a gamātra . A gamātra times a gamātra is a namātra . A namātra times a namātra is a hemātra . A hemātra times a hemātra is a vimātra . A vimātra times a vimātra is a paramātra . A paramātra times a paramātra is a śivamātra . A śivamātra times a śivamātra is an ela . An ela times an ela is a vela . A vela times a vela is a tela . A tela times a tela is a śaila . A śaila times a śaila is a gela . A gela times a gela is a śila . A śila times a śila is a śvela . A śvela times a śvela is a nela . A nela times a nela is a bhela . A bhela times a bhela is a kela . A kela times a kela is a sela . A sela times a sela is a pela . A pela times a pela is a hela . A hela times a hela is a mela . A mela times a mela is a saraḍa . A saraḍa times a saraḍa is a māruta . A māruta times a māruta is a meruda . A meruda times a meruda is a kheluda . A kheluda times a kheluda is a māluda . A māluda times a māluda is a samula . A samula times a samula is an ayava . An ayava times an ayava is a kamala . A kamala times a kamala is a magava . A magava times a magava is an atara . An atara times an atara is a heluya . A heluya times a heluya is a veluva . A veluva times a veluva is a kajāva . A kajāva times a kajāva is a havava . A havava times a havava is a havala . A havala times a havala is a vivara . A vivara times a vivara is a bimba . A bimba times a bimba is a caraṇa . A caraṇa times a caraṇa is a carama . A carama times a carama is a parava . A parava times a parava is a dhavara . A dhavara times a dhavara is a dhamana . A dhamana times a dhamana is a pramada . A pramada times a pramada is a nigama . A nigama times a nigama is an upavarta . An upavarta times an upavarta is a nirdeśa . A nirdeśa times a nirdeśa is an akṣaya . An akṣaya times an akṣaya is a saṃbhūta . A saṃbhūta times a saṃbhūta is an amama . An amama times an amama is an avada . An avada times an avada is an utpala . An utpala times an utpala is a padma . A padma times a padma is a saṃkhya . A saṃkhya times a saṃkhya is a gati . A gati times a gati is an upagama . An upagama times an upagama is an aupamya . An aupamya times an aupamya is an asaṃkhyeya . An asaṃkhyeya times an asaṃkhyeya is an asaṃkhyeya­parivarta . An asaṃkhyeya­parivarta times an asaṃkhyeya­parivarta is an aparimāṇa . An aparimāṇa times an aparimāṇa is an aparimāṇa­parivarta . An aparimāṇa­parivarta times an aparimāṇa­parivarta is an aparyanta . An aparyanta times an aparyanta is an aparyanta­parivarta . An aparyanta­parivarta times an aparyanta­parivarta is an asamanta . An asamanta times an asamanta is an asamanta­parivarta . An asamanta­parivarta times an asamanta­parivarta is an agaṇeya . An agaṇeya times an agaṇeya is an agaṇeya­parivarta . An agaṇeya­parivarta times an agaṇeya­parivarta is an atulya . An atulya times an atulya is an atulya­parivarta . An atulya­parivarta times an atulya­parivarta is an acintya . An acintya times an acintya is an acintya­parivarta . An acintya­parivarta times an acintya­parivarta is an aparyanta . An aparyanta times an aparyanta is an aparyanta­parivarta . An aparyanta­parivarta times an aparyanta­parivarta is an amāpya . An amāpya times an amāpya is an amāpya­parivarta . An amāpya­parivarta times an amāpya­parivarta is an anabhilāpya . An anabhilāpya times an anabhilāpya is an anabhilāpya­parivarta . An anabhilāpya­parivarta times an anabhilāpya­parivarta is an anabhilāpyānabhilāpya . An anabhilāpyānabhilāpya times an anabhilāpyānabhilāpya is an anabhilāpyānabhilāpya­parivarta

source: །དེའི་མདུན་ན་བྱེ་མའི་ཕུང་པོ་ཆེན་པོ་དཔག་ཚད་དུ་མའི་ཚད་དང་ལྡན་པ་ཞིག་འདུག་འདུག་པ་ལས།
en: In front of Indriyeśvara there was a heap of sand that was many yojanas high.

source: །འདི་ལ་བྱེ་མའི་འབྲུ་འདི་སྙེད་ཅིག་ཡོད་དོ་ཞེས་བྱ་བ་ནས། བྱེ་མའི་འབྲུ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་ལ་བསྒྲེས་པ་ལ་འདི་སྙེད་ཅིག་ཡོད་དོ་ཞེས་རབ་ཏུ་ཕྱེ་ནས་བགྲང་བརྩིས་ཏེ་གྲངས་སུ་བཅད་དོ། །དེས་བྱེ་མའི་ཕུང་པོ་དེ་བརྩིས་ཀྱི་བརྡར་བསྟན་པས། ཤིན་ཏུ་བསྟན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བགྲང་བའི་ཚུལ་འདི་ནི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཀུན་ནའང་ཡོད་དེ།
en: He counted how many grains of sand there were in that heap, beginning with “the number of grains of sand in this mound” and continuing until he said, “there are an anabhilāpyānabhilāpya­parivarta of grains of sand in this heap.” Having taught Sudhana through the teaching that stipulated the number of grains of sand in that heap of sand, he said, “Noble one, this method of counting of the bodhisattvas continues from one world realm to another.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བགྲང་བའི་ཚུལ་འདིས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་དག་ཀྱང་བགྲང་ཞིང་རྩིའོ།
en: With this method of counting of the bodhisattvas, one can calculate the number of the entire extent of world realms in the eastern direction.

source: །དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་འཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་འཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་འཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་འཚམས་དང་། །འོག་དང་སྟེང་གི་ཕྱོགས་སུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བགྲང་བའི་ཚུལ་འདིས་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་བ་དག་ཀྱང་བགྲང་ཞིང་རྩིའོ།
en: In the same way, with this method of counting of the bodhisattvas, one can calculate the number of the entire extent of world realms in the southern direction, in the western direction, in the northern direction, in the northeastern direction, in the southeastern direction, in the southwestern direction, in the northwestern direction, in the upward direction, and in the downward direction.

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བགྲང་བའི་ཚུལ་འདི་ནི། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མྱིང་དུ་བྱ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་ཐམས་ཅད་ནའང་ཡོད་དོ།
en: “Noble one, with this method of counting of the bodhisattvas, the entire extent of the succession of the names of world realms in the ten directions are taught;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བགྲང་བའི་ཚུལ་འདིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བགྲང་ཞིང་རྩིའོ།
en: with this method of counting of the bodhisattvas, the entire extent of the succession of the names of world realms in the ten directions is counted.

source: །ཇི་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་བསྐལ་པའི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་དང་། སངས་རྒྱས་ཀྱི་མཚན་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་དང་། ཆོས་ཀྱི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་དང་། སེམས་ཅན་གྱི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་དང་། ལས་ཀྱི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་ཀུན་ལའང་འཇུག་སྟེ།
en: “Just as the entire extent of the succession of world realms in the ten directions is taught, in the same way the succession of names of kalpas in the ten directions is taught, the succession of the names of buddhas is taught, the succession of the names of Dharmas is taught, the succession of the names of beings is taught, and the succession of the names of actions is taught, so that all these are comprehended.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བགྲང་བའི་ཚུལ་འདི་ཉིད་ནི། ཕྱོགས་བཅུ་ན་མྱིང་དུ་བྱ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་རུང་བ་ཇི་སྙེད་པ་ཐམས་ཅད་ལའང་འཇུག་སྟེ།
en: “With this method of counting of the bodhisattvas, the entirety of however many successions of names that can be taught and that are in the ten directions is comprehended in full.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བགྲད་བའི་ཚུལ་འདིས་ཕྱོགས་བཅུ་ན་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཇི་སྙེད་ཡོད་པ་ཐམས་ཅད་ཀྱང་བགྲང་ཞིང་རྩིའོ།
en: “With this method of counting of the bodhisattvas, the entirety of however many successions of names that can be taught and that are in the ten directions is counted in full.

source: །དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྣང་བ་ཆོས་ཐམས་ཅད་ཤེས་པར་བྱ་བའི་བཟོ་མངོན་པར་ཤེས་པ་དང་ལྡན་པ་འདི་ཤེས་བར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་གྲངས་ལ་ཞུགས་པ། ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་ཀྱི་གྲངས་ལ་ཞུགས་པ། དུས་གསུམ་གྱི་གྲངས་ལ་ཞུགས་པ།
en: “However, noble one, in that way I know only this light of bodhisattva wisdom that is the possession of the clairvoyance of crafts that is the knowledge of all phenomena.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་གྲངས་ལ་ཞུགས་པ། ཆོས་ཀྱི་ཕུང་པོ་ཐམས་ཅད་ཀྱི་གྲངས་ལ་ཞུགས་པ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་གྲངས་ལ་ཞུགས་པ། །ཆོས་ཐམས་ཅད་ཀྱི་མིང་གི་འཁོར་ལོ་ལ་དབང་བསྒྱུར་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་བའམ།
en: How could I know the conduct of the bodhisattvas who engage with the number of all beings, who engage with the number of all the accumulations of Dharmas, who engage with the number of all the buddhas and bodhisattvas, and who have power over the wheel of the names of all the Dharmas?

source: ཡོན་ཏན་བརྗོད་པའམ།
en: How could I describe their qualities?

source: སྤྱོད་ཡུལ་སྨོས་པའམ།
en: How could I reveal the range of their activity?

source: །ཡུལ་བརྗོད་པའམ།
en: How could I elucidate the scope of their knowledge?

source: སྟོབས་བསྔགས་པའམ།
en: How could I praise their strengths?

source: བསམ་པ་བརྟན་པའམ།
en: How could I proclaim their resolute intentions?

source: ཚོགས་ཡོངས་སུ་བརྗོད་པའམ།
en: How could I cast light on their accumulations?

source: སྨོན་ལམ་བཤད་པར་བྱ་བ་འམ།
en: How could I explain their prayers?

source: སྤྱོད་པ་ཡོངས་སུ་བསྟན་པའམ།
en: How could I teach their conduct?

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་མངོན་པར་བརྗོད་པའམ།
en: How could I speak of their pure perfections?

source: ཡང་དག་པར་བསྒྲུབ་པ་ཡོངས་སུ་དག་པའམ། ཡང་དག་པར་བསྟན་པའམ།
en: How could I make clear their pure attainments?

source: ཏིང་ངེ་འཛིན་གྱི་ཁྱད་པར་སྨོས་པའམ།
en: How could I describe the range of their samādhis?
